app/controllers/lists_controller.rb

  def index
    @list = List.new
    @lists = List.all
---
SELECT "lists".* FROM "lists"

  def show
    @list = List.find(params[:id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @list = List.new(list_params)
    if @list.save
---
INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Shopping List"], ["created_at", "2018-12-19 17:18:13.324845"], ["updated_at", "2018-12-19 17:18:13.324845"]]