app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["email", "shmulywolfson@gmail.com"]]
INSERT INTO "users" ("email", "created_at", "updated_at") VALUES (?, ?, ?)  [["email", "Shmully@learn.co"], ["created_at", "2018-12-31 16:42:21.335210"], ["updated_at", "2018-12-31 16:42:21.335210"]]
---
  def create
    if auth_hash = request.env['omniauth.auth']
      oauth_email = request.env['omniauth.auth']["info"]["email"]
      if user = User.find_by(:email => oauth_email)
        session[:user_id] = user.id
        # binding.pry
        redirect_to root_path
      else
        user = User.create(email: oauth_email, password: SecureRandom.hex)