app/controllers/users_controller.rb

  def create
    @user = User.new
    @user.email = params[:user][:email]

    if @user.save
---
INSERT INTO "users" ("email", "created_at", "updated_at") VALUES (?, ?, ?)  [["email", "aksjdfh"], ["created_at", "2018-12-27 19:10:03.366188"], ["updated_at", "2018-12-27 19:10:03.366188"]]